#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
data.archive_file.this: Reading...
data.archive_file.this: Read complete after 0s [id=4fa71cecf5b6159fee248c24fd74c9cfc7dcd722]
data.aws_region.current: Reading...
data.aws_iam_policy_document.assume_role: Reading...
data.aws_caller_identity.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3693445097]
data.aws_caller_identity.current: Read complete after 0s [id=402889198055]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject*",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ssm:DescribeParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:us-east-1:402889198055:parameter/tesla-data-exporter/*",
            ]
        }
    }

  # aws_cloudwatch_event_rule.this will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = (known after apply)
      + name_prefix         = "tesla-data-exporter"
      + schedule_expression = "rate(8 hours)"
      + tags_all            = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
    }

  # aws_cloudwatch_event_target.this will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/tesla-data-exporter"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
    }

  # aws_iam_policy.lambda will be created
  + resource "aws_iam_policy" "lambda" {
      + arn         = (known after apply)
      + description = "IAM policy for tesla-data-exporter"
      + id          = (known after apply)
      + name        = "tesla-data-exporter"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
    }

  # aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "tesla-data-exporter"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "tesla-data-exporter"
    }

  # aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "lambda.zip"
      + function_name                  = "tesla-data-exporter"
      + handler                        = "function.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.10"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "MSZkmHNZJjESHipHzgC3AbkNcA7bu+qbvzur9x/RmZg="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
      + timeout                        = 15
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }
    }

  # aws_lambda_permission.cloudwatch will be created
  + resource "aws_lambda_permission" "cloudwatch" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "tesla-data-exporter"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromCloudWatch"
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "tesla-data-exporter"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_ssm_parameter.email will be created
  + resource "aws_ssm_parameter" "email" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/tesla-data-exporter/email"
      + tags_all       = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.refresh_token will be created
  + resource "aws_ssm_parameter" "refresh_token" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/tesla-data-exporter/refresh_token"
      + tags_all       = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bucket_name = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @cvanlaw, Action: `pull_request`*